puts '                                      Системы контроля версий'

# Системы контроля/управления версиями (СКВ, VCS, Version Control Systems) - позволяют разработчикам сохранять все изменения, внесённые в код и иметь доступ к разным версии программы и ее прошлым состояним

# При возникновении проблем они могут просто откатить код до рабочего состояния и не тратить часы на поиски ошибок.

# Позволяют нескольким разработчикам работать над одним проектом и сохранять внесённые изменения независимо друг от друга. При этом каждый участник команды видит, над чем работают коллеги



puts '                                     Типы систем контроля версий'

# 1. (ЛСКВ) Локальные системы контроля версий - различные версии хранятся в различных директориях на компьютере

# 2. (ЦСКВ) Централизованные системы контроля версий - имеют единственный сервер, содержащий все версии файлов (выход сервера из строя обернётся потерей всех данных)

# 3. (РСКВ) Распределённые системы контроля версий - у каждого клиента есть копия всего исходного кода и внесённых изменений. Если один из серверов выйдет из строя, любой клиентский репозиторий может быть скопирован на другой сервер для продолжения работы. Могут одновременно взаимодействовать с несколькими удалёнными репозиториями, благодаря этому разработчики могут параллельно работать над несколькими проектами.














#
