puts '                                                GitHub'

# GitHub - это сайт-сервис онлайн-хостинга репозиториев/сервера/облачного хрпнилища/удаленного репозитория, обладающий всеми функциями распределённого контроля версий и функциональностью управления исходным кодом — всё, что поддерживает Git и даже больше, на котором мы можем сохранять наши репозитори. Далее мы или наша команда смогут с ними работать(качать дополнять итд). Так же мы можем качать(при помощи git clone) то что есть в открытом доступе, например библиотеки гемы итд.

# (Кроме GitHub есть другие сервисы, которые используют Git, — например, Bitbucket и GitLab)



puts '                                        GitHub(Размер репозитория)'

# Рекомендованные размеры: фаилы не более 50мб, весь репозиторий не более 1гб.

# Если вы являетесь владельцем репозитория, вы можете узнать точный размер, открыв Настройки учетной записи → Репозитории:
# https://github.com/settings/repositories
# Если вы не являетесь владельцем репозитория, вы можете создать его форк и проверить его там же

# Вы можете быть владельцем организации, которая размещает несколько репозиториев, и при этом не иметь роли в определенном репозитории внутри организации. По умолчанию, даже если вы создаете репозиторий в организации, которой владеете, вы не добавляетесь в репозиторий и, следовательно, не видите этот репозиторий в settings/repositories. Поэтому добавьте себя в репозиторий Setting:
# https://github.com/org-name/repo-name/settings
# чтобы увидеть его в:
# https://github.com/settings/repositories












# 
