puts '                                               GitHub'

# GitHub - это сайт-сервис онлайн-хостинга репозиториев, обладающий всеми функциями, что поддерживает Git и своими дополнительными. Позволяет хранить и осуществлять совместное с другими разработчиками использование репозиториев



puts '                                          Размер репозитория'

# Рекомендованные размеры фаилов: не более 50мб.
# Рекомендованные размеры всего репозитория: не более 1гб.

# Владельцем репозитория может узнать его точный размер, открыв 'Настройки' → 'Репозитории'
# https://github.com/settings/repositories
# Не владелец может создать его форк и проверить его там же

# Вы можете быть владельцем организации, которая размещает несколько репозиториев, и при этом не иметь роли в определенном репозитории внутри организации. По умолчанию, даже если вы создаете репозиторий в организации, которой владеете, вы не добавляетесь в репозиторий и, следовательно, не видите этот репозиторий в settings/repositories. Поэтому добавьте себя в репозиторий Setting:
# https://github.com/org-name/repo-name/settings
# чтобы увидеть его в:
# https://github.com/settings/repositories












#
