puts '                                          GitHub Pages(хостинг)'

# https://pages.github.com/    - облегченный хостинг.

# Работает только с открытым для других репозиторием

# Не поддерживает технологии: php, mySQL
# Поддерживает: js, jquery, bootstrap


# Способ для уже созданного репозитория:
# https://docs.github.com/ru/pages/getting-started-with-github-pages/configuring-a-publishing-source-for-your-github-pages-site
# 1. Заходим в 'Settings' на странице репозитория
# 2. Находим пункт 'Pages' в меню слева, нажимаем
# 3. В разделе 'Branch' на кнопке вместо 'None' выбираем необходимую ветку
# 4. На основной странице репозитория справа внизу в пункте 'environments' можно перейти на нашу страницу и там же посмотреть ссылку на нее


# Способ создания сразу с репозиторием (https://pages.github.com/ - инструкция тут):
#     1. Создать новый публичный репозиторий сназванием 'username.github.io', где username — это ваше имя пользователя (или название организации) на GitHub. Если первая часть названия репозитория не совпадает с вашим именем пользователя, он не будет работать, поэтому убедитесь, что вы указали его правильно.
#     2. Перейдите в папку, в которой вы хотите сохранить свой проект, и клонируйте новый репозиторий:
# $ git clone https://github.com/имя_пользователя/имя_пользователя.github.io
#     3. Войдите в папку проекта и добавьте файл index.html:
# $ cd имя_пользователя.github.io
# $ echo "Привет, мир" > index.html
#     4. Добавьте, зафиксируйте и отправьте свои изменения:
# $ git add --all
# $ git commit -m "Начальный коммит"
# $ git push -u origin main
#     5. Запустите браузер и перейдите по адресу https://имя_пользователя.github.io















#
