puts '                                          GitHub Pages(хостинг)'

# https://pages.github.com/

# GitHub Pages  - облегченный хостинг предоставляемый GitHub

# Работает только с репозиториями с публичным доступом

# Не поддерживает технологии: php, mySQL
# Поддерживает: js, jquery, bootstrap



puts '                                    Захостить уже созданный репозиторий'

# https://docs.github.com/ru/pages/getting-started-with-github-pages/configuring-a-publishing-source-for-your-github-pages-site

# 1. В *Settings* на странице репозитория
# 2. Находим пункт *Pages* в меню слева, нажимаем
# 3. В разделе *Branch* на кнопке вместо 'None' выбираем необходимую ветку
# 4. На основной странице репозитория справа внизу в пункте *environments* можно перейти на нашу страницу и там же посмотреть ссылку на нее



puts '                            Новый репозиторий который будет хоститься по умолчанию'

# 1. Создать новый публичный репозиторий сназванием 'username.github.io', где username — это ваше имя пользователя или название организации на GitHub. Если первая часть названия репозитория не совпадает с вашим именем пользователя, он не будет работать.

# 2. Перейдите в папку, в которой вы хотите сохранить свой проект, и клонируйте новый репозиторий:
# $ git clone https://github.com/имя_пользователя/имя_пользователя.github.io

# 3. Войдите в папку проекта и добавьте файл, например index.html

# 4. Добавьте, зафиксируйте и отправьте свои изменения:
# $ git add --all
# $ git commit -m "Начальный коммит"
# $ git push -u origin main

# 5. Запустите браузер и перейдите по адресу https://имя_пользователя.github.io















#
