puts '                                     Поиск репозиториев'

# GitHub Topics - можно искать репозитории по темам. Например, можно посетить [Ruby on Rails GitHub Topic](https://github.com/topics/ruby-on-rails), где собраны проекты, помеченные темой Ruby on Rails



puts '                          Фильтры расширенного поиска в поискоой строке'

# Фильтрация результатов: После выполнения поиска (ключевые слова) можно использовать фильтры, чтобы сузить результаты по количеству звезд, дате последнего обновления и другим критериям

# language: - фильтр по языку в проекте
# "rails" language:ruby                  - для поиска проектов на Ruby on Rails по ключевому слову для поииска "rails"
# "Capybara" "Dockerfile" language:Ruby  - по 2м ключевым словам

# stars: - фильтр по числу звезд
# stars:>100                             - найти проекты с более чем 100 звезд

# fork: - фильтрует форки других репозиториев
# fork:true                              - поиск только форков


# Дополнительные операторы: Если нужно более точное совпадение, можно использовать дополнительные операторы

# in:
# Capybara in:readme "Dockerfile" language:Ruby   - будет искать упоминание Capybara в README-файлах














#
