puts '                                               Git'

# Git — распределённая система контроля версий, которая даёт возможность разработчикам отслеживать изменения в файлах и работать над одним проектом совместно с коллегами.

# Каждый раз, когда вы сохраняете состояние своего проекта в Git, система запоминает, как выглядит каждый файл в этот момент, и сохраняет ссылку на этот снимок.

# Можно использовать при помощи команд терминала или при помощи дополнительно устанавливаемых графических оболочек

# сервисы для хостинга Git-репозиториев: GitHub, Bitbucket, GitLab итд



puts '                                              commit'

# commit (вклад) - в Git это значит наш вклад как разработчика в репозиторий исходного кода

# атомарность коммитов - желательно коммитить изменения отдельных фаилов отдельными коммитами для каждого

# коментарий к коммиту нужно писать информативным, чтобы другим разработчикам проекта было понятно

# initial commit - так обычно называют первый/начальный коммит в репозитории(но можно как угодно).


# Если мы делаем новый коммит и меняем какой-то фаил, то в него попадет только разница между этими изменениями и тем, что было в репозитории на момент предыдущего коммита
















#
