puts '                                               Git'

# Git — распределённая система контроля версий, которая даёт возможность разработчикам отслеживать изменения в файлах и работать над одним проектом совместно с коллегами. Самая популярная из всех

# Git придуман Линусом Торвальдсом

# Каждый раз, когда вы сохраняете состояние своего проекта в Git, система запоминает, как выглядит каждый файл в этот момент, и сохраняет ссылку на этот снимок.
# Гит отслеживает изменения на уровне отдельных строк в фаилах, а не просто фаилов целиком

# Можно использовать при помощи команд терминала или при помощи дополнительно устанавливаемых графических оболочек



puts '                                           Репозиторий'

# Это папка на локальном компьютере или в удаленном хранилище где хранятся все "снимки" нашего проекта к которому подключен Git

# Распредеделенный репозиторий - это когда проект хранится и локально и на удаленном репозитории, откуда его может скачать другой разраб

# Сервисы для хостинга Git-репозиториев: GitHub, Bitbucket, GitLab итд
# Так же хранить удаленно версии репозиториев могут хостинги сайтов, например Heroku чтобы заливать туда код, который и будет использоваться для работы приложения



puts '                                              commit'

# commit (вклад) - в Git это значит наш вклад как разработчика в репозиторий исходного кода. Это сохраненный в репозитории новый вариант проекта

# атомарность коммитов - желательно коммитить изменения отдельных фаилов отдельными коммитами для каждого

# коментарий к коммиту нужно писать информативным, чтобы другим разработчикам проекта было понятно

# initial commit - так обычно называют первый/начальный коммит в репозитории(но можно как угодно).


# Если мы делаем новый коммит и меняем какой-то фаил, то в него попадет только разница между этими изменениями и тем, что было в репозитории на момент предыдущего коммита
















#
